perpendicular-flap/fluid-openfoam/dealii-dt-0.01-subcycling-dt-0.001-waveform-0/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;
